### Part 1 - Grouping and Aggregation 
1. Open a new folder on your desktop named Python_Class 
2. Go to the folder you opened, and create a new notebook called Ex_sol_6 
(Make sure that a notebook has been opened in the desired location) 
3. Import the Pandas Library to the notebook ### Part 2 - Pivot Table

In [2]:
import pandas as pd

Concatenate

In this section we will look at the daily grocery shopping list of three families    
5. From the "Data" folder, import the following files into DataFrame objects, and display their contents:    
(These files contain each family's daily shopping list)

In [3]:
df1 = pd.read_csv('Family_1_groceries.csv')
df2 = pd.read_csv('Family_2_groceries.csv')
df3 = pd.read_csv('Family_3_groceries.csv')

In [4]:
df1

   Customer no  Product Code
0            1          1003
1            1          1011
2            1          1010
3            1          1008
4            1          1002

In [5]:
df2

   Customer no  Product Code
0            2          1000
1            2          1004
2            2          1011
3            2          1003
4            2          1009

In [6]:
df3

   Customer no  Product Code
0            3          1000
1            3          1004
2            3          1011
3            3          1003
4            3          1009
5            3          1000
6            3          1002

In [7]:
# 6. Merge the shopping data of the three families (df1, df2, df3) into a new DataFrame called shop_df, which will contain the complete shopping list of all the families. 
shop_df = pd.concat([df1, df2, df3], ignore_index=True)

In [8]:
# 7. Because the indices of the rows are in disarray, please re-index the rows anew.
shop_df

    Customer no  Product Code
0             1          1003
1             1          1011
2             1          1010
3             1          1008
4             1          1002
5             2          1000
6             2          1004
7             2          1011
8             2          1003
9             2          1009
10            3          1000
11            3          1004
12            3          1011
13            3          1003
14            3          1009
15            3          1000
16            3          1002

In [9]:
# 9. Which families purchased item number 1011 or 1000 
# If you need to look for a method that deletes duplicate values, search the web for how to do this
shop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Customer no   17 non-null     int64
 1   Product Code  17 non-null     int64
dtypes: int64(2)
memory usage: 404.0 bytes

In [10]:
shop_df.describe()

       Customer no  Product Code
count    17.000000     17.000000
mean      2.117647   1005.294118
std       0.857493      4.179783
min       1.000000   1000.000000
25%       1.000000   1002.000000
50%       2.000000   1004.000000
75%       3.000000   1009.000000
max       3.000000   1011.000000

In [11]:
shop_df.shape[0]

17

In [12]:
# 9. Which families purchased item number 1011 or 1000
where1 = shop_df['Product Code'] == 1011
where2 = shop_df['Product Code'] == 1000

shop_df[where1 | where2]['Customer no']

1     1
5     2
7     2
10    3
12    3
15    3
Name: Customer no, dtype: int64

In [13]:
# How to distinct?
shop_df[where1 | where2]['Customer no'].drop_duplicates()

1     1
5     2
10    3
Name: Customer no, dtype: int64

In [14]:
# 10. What is the best-selling item, and how many times was it sold?
shop_df['Product Code'].value_counts()
# best_selling_item = shop_df['Product Code'].value_counts().idxmax()

Product Code
1003    3
1011    3
1000    3
1002    2
1004    2
1009    2
1008    1
1010    1
Name: count, dtype: int64

In [15]:
# 11. Which family purchased the most items, how many times did the family shop?
shop_df['Customer no'].value_counts().head(1)

Customer no
3    7
Name: count, dtype: int64

In [16]:
# 12. Which family bought the most items if you donâ€™t include the sales for items 1000 & 1011.
where1 = shop_df['Product Code'] != 1011
where2 = shop_df['Product Code'] != 1000
shop_df[where1 & where2]['Customer no'].value_counts()

Customer no
1    4
3    4
2    3
Name: count, dtype: int64

In [17]:
# 13. How many times was item number 1003 purchased?
# shop_df[shop_df['Product Code'] == 1003]['Product Code'].count()

shop_df['Product Code'].value_counts()[1003]

np.int64(3)

### Part 2 - Merging DataFrames

Merge

In [21]:
gr_df = pd.read_csv('groceries.csv')
gr_df

    Code     Description  Price
0   1000           Bread    7.5
1   1001        Soy milk   10.0
2   1002            Eggs   30.0
3   1003          Cheese    5.5
4   1004   Mineral water   12.0
5   1005           Pasta    5.0
6   1006           Bamba    5.0
7   1007         Almonds   20.0
8   1008          Quinoa   15.0
9   1009            Rice   10.0
10  1010           Honey   13.0
11  1011  Dark Chocolate   21.0

In [22]:
shop_df

    Customer no  Product Code
0             1          1003
1             1          1011
2             1          1010
3             1          1008
4             1          1002
5             2          1000
6             2          1004
7             2          1011
8             2          1003
9             2          1009
10            3          1000
11            3          1004
12            3          1011
13            3          1003
14            3          1009
15            3          1000
16            3          1002

2. From the "Data" folder, import the Groceries file into a variable named gr_df

In [23]:
# 3. Merge the information from gr_df and shop_df into a new variable called sales, so that for each row in shop_df, the product description and price will also be added. 
shop_df.merge( gr_df, left_on='Product Code', right_on='Code',how='left')

    Customer no  Product Code  Code     Description  Price
0             1          1003  1003          Cheese    5.5
1             1          1011  1011  Dark Chocolate   21.0
2             1          1010  1010           Honey   13.0
3             1          1008  1008          Quinoa   15.0
4             1          1002  1002            Eggs   30.0
5             2          1000  1000           Bread    7.5
6             2          1004  1004   Mineral water   12.0
7             2          1011  1011  Dark Chocolate   21.0
8             2          1003  1003          Cheese    5.5
9             2          1009  1009            Rice   10.0
10            3          1000  1000           Bread    7.5
11            3          1004  1004   Mineral water   12.0
12            3          1011  1011  Dark Chocolate   21.0
13            3          1003  1003          Cheese    5.5
14            3          1009  1009            Rice   10.0
15            3          1000  1000           Bread    7.5
16            3          1002  1002            Eggs   30.0

In [24]:
sales = shop_df.merge( gr_df, left_on='Product Code', right_on='Code',how='left')
sales

    Customer no  Product Code  Code     Description  Price
0             1          1003  1003          Cheese    5.5
1             1          1011  1011  Dark Chocolate   21.0
2             1          1010  1010           Honey   13.0
3             1          1008  1008          Quinoa   15.0
4             1          1002  1002            Eggs   30.0
5             2          1000  1000           Bread    7.5
6             2          1004  1004   Mineral water   12.0
7             2          1011  1011  Dark Chocolate   21.0
8             2          1003  1003          Cheese    5.5
9             2          1009  1009            Rice   10.0
10            3          1000  1000           Bread    7.5
11            3          1004  1004   Mineral water   12.0
12            3          1011  1011  Dark Chocolate   21.0
13            3          1003  1003          Cheese    5.5
14            3          1009  1009            Rice   10.0
15            3          1000  1000           Bread    7.5
16            3          1002  1002            Eggs   30.0

In [25]:
# 4. Delete repetitive columns, if there are any. The Sales variable will contain the following columns:
# sales = sales[['Customer no', 'Product Code', 'Description', 'Price']]
sales.drop(columns=['Code'], inplace=True)
sales

    Customer no  Product Code     Description  Price
0             1          1003          Cheese    5.5
1             1          1011  Dark Chocolate   21.0
2             1          1010           Honey   13.0
3             1          1008          Quinoa   15.0
4             1          1002            Eggs   30.0
5             2          1000           Bread    7.5
6             2          1004   Mineral water   12.0
7             2          1011  Dark Chocolate   21.0
8             2          1003          Cheese    5.5
9             2          1009            Rice   10.0
10            3          1000           Bread    7.5
11            3          1004   Mineral water   12.0
12            3          1011  Dark Chocolate   21.0
13            3          1003          Cheese    5.5
14            3          1009            Rice   10.0
15            3          1000           Bread    7.5
16            3          1002            Eggs   30.0

In [ ]:
# 5. What is the total purchase amount for all of the families?
sales